src/test/resources/walletpayment/disableWallet/disableWalletRequestMinimal.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <ns2:disableWalletRequest xmlns="http://obj.ws.payline.experian.com" xmlns:ns2="http://impl.ws.payline.experian.com">
            <ns2:contractNumber>contractNumber</ns2:contractNumber>
            <ns2:cardInd>1</ns2:cardInd>
            <ns2:walletIdList>
                <walletId>WalletId1</walletId>
            </ns2:walletIdList>
        </ns2:disableWalletRequest>
    </S:Body>
</S:Envelope>